/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "membership_gate": {
      "type": "membership-gate",
      "settings": {
        "enabled": true
      }
    },
    "exercise_page": {
      "type": "exercise-page",
      "blocks": {
        "tutorial_step_l_raises_1": {
          "type": "tutorial_step",
          "settings": {
            "title": "Step 1",
            "description": "Hold very light weights and simultaneously raise one arm forward and the other arm sideways, forming an L shape.",
            "note": "Stop both arms when they reach shoulder height.",
            "caution": "Keep your elbows slightly bent and avoid lifting the weights higher than your shoulders.",
            "alt_text": "Exercise step",
            "image_position": "left"
          }
        }
      },
      "block_order": [
        "tutorial_step_l_raises_1"
      ],
      "settings": {
        "badge_text": "Upper Body Exercise",
        "title": "L-Raises",
        "title_highlight": "L-Raises",
        "subtitle": "An effective isolation exercise targeting the anterior and lateral deltoids. Perfect for developing shoulder strength and definition while improving shoulder stability.",
        "target": "Shoulders (Anterior and Lateral Deltoids)",
        "about_title": "About the Exercise",
        "about_description": "L-Raises are a targeted shoulder exercise that simultaneously works the anterior (front) and lateral (side) deltoids. This movement helps develop balanced shoulder strength, improves shoulder stability, and enhances upper body aesthetics. The exercise requires light weights and controlled movement, making it ideal for both beginners and advanced lifters looking to refine their shoulder development."
      }
    }
  },
  "order": [
    "membership_gate",
    "exercise_page"
  ]
}

